package com.andlinks.mybatis.test;

import com.google.gson.*;
import net.sf.json.JSONArray;
import net.sf.json.JSONObject;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 * Created by 陈亚兰 on 2018/1/4.
 */
public class JSON {
    public static void main(String[] args){
        String a="[\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"上海市\",\n" +
                "      666\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"云南省\",\n" +
                "      90\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"内蒙古自治区\",\n" +
                "      252\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"北京市\",\n" +
                "      678\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"吉林省\",\n" +
                "      144\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"四川省\",\n" +
                "      756\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"天津市\",\n" +
                "      204\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"宁夏回族自治区\",\n" +
                "      66\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"安徽省\",\n" +
                "      840\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"山东省\",\n" +
                "      1866\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"山西省\",\n" +
                "      240\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"广东省\",\n" +
                "      1452\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"广西壮族自治区\",\n" +
                "      570\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"新疆维吾尔自治区\",\n" +
                "      108\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"江苏省\",\n" +
                "      1752\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"江西省\",\n" +
                "      1182\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"河北省\",\n" +
                "      1032\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"河南省\",\n" +
                "      1344\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"浙江省\",\n" +
                "      1776\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"海南省\",\n" +
                "      138\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"湖北省\",\n" +
                "      648\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"湖南省\",\n" +
                "      738\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"甘肃省\",\n" +
                "      162\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"福建省\",\n" +
                "      798\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"贵州省\",\n" +
                "      210\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"辽宁省\",\n" +
                "      480\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"重庆市\",\n" +
                "      396\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"陕西省\",\n" +
                "      534\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"青海省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第一终端\",\n" +
                "      \"黑龙江省\",\n" +
                "      492\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"上海市\",\n" +
                "      162\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"云南省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"北京市\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"吉林省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"四川省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"安徽省\",\n" +
                "      42\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"山东省\",\n" +
                "      84\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"山西省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"广东省\",\n" +
                "      144\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"广西壮族自治区\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"江苏省\",\n" +
                "      192\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"江西省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"河北省\",\n" +
                "      30\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"河南省\",\n" +
                "      60\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"浙江省\",\n" +
                "      456\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"湖南省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"福建省\",\n" +
                "      24\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"辽宁省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"重庆市\",\n" +
                "      96\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"陕西省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第三终端\",\n" +
                "      \"黑龙江省\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"上海市\",\n" +
                "      30\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"云南省\",\n" +
                "      42\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"内蒙古自治区\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"北京市\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"吉林省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"四川省\",\n" +
                "      42\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"天津市\",\n" +
                "      30\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"宁夏回族自治区\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"山东省\",\n" +
                "      48\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"山西省\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"广东省\",\n" +
                "      72\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"新疆维吾尔自治区\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"江苏省\",\n" +
                "      198\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"江西省\",\n" +
                "      12\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"河北省\",\n" +
                "      18\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"河南省\",\n" +
                "      54\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"海南省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"湖北省\",\n" +
                "      60\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"甘肃省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"福建省\",\n" +
                "      150\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"贵州省\",\n" +
                "      6\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"辽宁省\",\n" +
                "      54\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"重庆市\",\n" +
                "      36\n" +
                "    ],\n" +
                "    [\n" +
                "      \"第二终端\",\n" +
                "      \"陕西省\",\n" +
                "      30\n" +
                "    ]\n" +
                "  ]";

                        Gson gson = new Gson();
         System.out.println(a);
         System.out.println("\n\n=============\n\n");
        JsonParser parser = new JsonParser();
        JsonArray Jarray = parser.parse(a).getAsJsonArray();
        List<String> first=new ArrayList<>();
        List<String> second=new ArrayList<>();
        List<String> third=new ArrayList<>();
        for(Object o:Jarray){
           if(o.toString().contains("第一终端")){
               first.add(o.toString());
           }
        }
        List<String> key= Arrays.asList("terminal","province","num");
        List<JSONObject> f=putKey(key,first);
        for(int i=0;i<f.size();i++){
            System.out.println(f.get(i));
        }

    }
    public static  List<JSONObject> putKey(List<String> keyList, List<String> valueList){
        List<JSONObject> result=new ArrayList<>();
        for(int i=0;i<valueList.size();i++){
            JSONObject jsonObject=new JSONObject();
            JSONArray valueArray = JSONArray.fromObject(valueList.get(i));
            for(int j=0;j<3;j++){
                jsonObject.put(keyList.get(j),valueArray.get(j));
            }
            result.add(jsonObject);
        }
        return result;
    }
}
